rails-blog/app/controllers/authors/posts_controller.rb

INSERT INTO "posts" ("title", "description", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "webo_news"], ["description", "fe"], ["author_id", 1], ["created_at", "2021-09-28 15:39:37.123010"], ["updated_at", "2021-09-28 15:39:37.123010"]]
---
    def create
      @post = current_author.posts.build(post_params)

      if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = ? AND "posts"."id" = ? LIMIT ?  [["author_id", 1], ["id", 3], ["LIMIT", 1]]
---
      def set_post
        @post = current_author.posts.find(params[:id])